package com.ezsign.window.vo;

import com.ezsign.feb.house.vo.YE710VO;
import com.ezsign.feb.worker.vo.YE700VO;

import java.util.List;

@SuppressWarnings("NonAsciiCharacters")
public class YW800Response {

    public boolean success;

    public WorkMonth 근무년월;

    public String 계약년도 = "";  // TODO 계약년도 지울것 (근무년월에 포함)

    public String 진행상태코드;  // TODO 진행상태코드 지울것 (근무년월에 포함)

    public String 소득세적용률;
    public String 연말정산분납여부;
    public String 거주구분;

    public List<YE700VO> 연말정산요약결과;

    public YE710VO 주택관련소득공제신청확인서;

    // 소득공제
    public int 인적공제_기본공제_본인 = 0;
    public int 인적공제_기본공제_배우자 = 0;
    public int 인적공제_기본공제_부양가족 = 0;
    public int 인적공제_추가공제_경로우대 = 0;
    public int 인적공제_추가공제_장애인 = 0;
    public int 인적공제_추가공제_부녀자 = 0;
    public int 인적공제_추가공제_한부모 = 0;

    public int 연금보험료공제_국민연금_주근무지 = 0;
    public int 연금보험료공제_국민연금_종근무지 = 0;
    public int 연금보험료공제_국민연금_추가납입 = 0;
    public int 연금보험료공제_공무원연금_주근무지 = 0;
    public int 연금보험료공제_공무원연금_종근무지 = 0;
    public int 연금보험료공제_공무원연금_추가납입 = 0;
    public int 연금보험료공제_군인연금_주근무지 = 0;
    public int 연금보험료공제_군인연금_종근무지 = 0;
    public int 연금보험료공제_군인연금_추가납입 = 0;
    public int 연금보험료공제_사립학교교직원연금_주근무지 = 0;
    public int 연금보험료공제_사립학교교직원연금_종근무지 = 0;
    public int 연금보험료공제_사립학교교직원연금_추가납입 = 0;
    public int 연금보험료공제_별정우체국연금_주근무지 = 0;
    public int 연금보험료공제_별정우체국연금_종근무지 = 0;
    public int 연금보험료공제_별정우체국연금_추가납입 = 0;

    public int 특별소득공제_보험료_건강보험료_주근무지 = 0;
    public int 특별소득공제_보험료_건강보험료_종근무지 = 0;
    public int 특별소득공제_보험료_건강보험료_추가납입 = 0;
    public int 특별소득공제_보험료_장기요양보험료_주근무지 = 0;
    public int 특별소득공제_보험료_장기요양보험료_종근무지 = 0;
    public int 특별소득공제_보험료_장기요양보험료_추가납입 = 0;
    public int 특별소득공제_보험료_고용보험료_주근무지 = 0;
    public int 특별소득공제_보험료_고용보험료_종근무지 = 0;
    public int 특별소득공제_보험료_고용보험료_추가납입 = 0;

    public int 특별소득공제_주택임차차입금_대출기관_국세청자료 = 0;
    public int 특별소득공제_주택임차차입금_대출기관_차감금액 = 0;
    public int 특별소득공제_주택임차차입금_대출기관_기타자료 = 0;
    public int 특별소득공제_주택임차차입금_거주자_국세청자료 = 0;
    public int 특별소득공제_주택임차차입금_거주자_차감금액 = 0;
    public int 특별소득공제_주택임차차입금_거주자_기타자료 = 0;

    public int 특별소득공제_장기주택저당차입금이자상환액_2011년이전_15년미만_국세청자료 = 0;
    public int 특별소득공제_장기주택저당차입금이자상환액_2011년이전_15년미만_차감금액 = 0;
    public int 특별소득공제_장기주택저당차입금이자상환액_2011년이전_15년미만_기타자료 = 0;
    public int 특별소득공제_장기주택저당차입금이자상환액_2011년이전_15년29년_국세청자료 = 0;
    public int 특별소득공제_장기주택저당차입금이자상환액_2011년이전_15년29년_차감금액 = 0;
    public int 특별소득공제_장기주택저당차입금이자상환액_2011년이전_15년29년_기타자료 = 0;
    public int 특별소득공제_장기주택저당차입금이자상환액_2011년이전_30년이상_국세청자료 = 0;
    public int 특별소득공제_장기주택저당차입금이자상환액_2011년이전_30년이상_차감금액 = 0;
    public int 특별소득공제_장기주택저당차입금이자상환액_2011년이전_30년이상_기타자료 = 0;
    public int 특별소득공제_장기주택저당차입금이자상환액_2012년이후_15년이상고정OR비거치_국세청자료 = 0;
    public int 특별소득공제_장기주택저당차입금이자상환액_2012년이후_15년이상고정OR비거치_차감금액 = 0;
    public int 특별소득공제_장기주택저당차입금이자상환액_2012년이후_15년이상고정OR비거치_기타자료 = 0;
    public int 특별소득공제_장기주택저당차입금이자상환액_2012년이후_15년이상기타_국세청자료 = 0;
    public int 특별소득공제_장기주택저당차입금이자상환액_2012년이후_15년이상기타_차감금액 = 0;
    public int 특별소득공제_장기주택저당차입금이자상환액_2012년이후_15년이상기타_기타자료 = 0;
    public int 특별소득공제_장기주택저당차입금이자상환액_2015년이후_15년이상고정AND비거치_국세청자료 = 0;
    public int 특별소득공제_장기주택저당차입금이자상환액_2015년이후_15년이상고정AND비거치_차감금액 = 0;
    public int 특별소득공제_장기주택저당차입금이자상환액_2015년이후_15년이상고정AND비거치_기타자료 = 0;
    public int 특별소득공제_장기주택저당차입금이자상환액_2015년이후_15년이상고정OR비거치_국세청자료 = 0;
    public int 특별소득공제_장기주택저당차입금이자상환액_2015년이후_15년이상고정OR비거치_차감금액 = 0;
    public int 특별소득공제_장기주택저당차입금이자상환액_2015년이후_15년이상고정OR비거치_기타자료 = 0;
    public int 특별소득공제_장기주택저당차입금이자상환액_2015년이후_15년이상기타_국세청자료 = 0;
    public int 특별소득공제_장기주택저당차입금이자상환액_2015년이후_15년이상기타_차감금액 = 0;
    public int 특별소득공제_장기주택저당차입금이자상환액_2015년이후_15년이상기타_기타자료 = 0;
    public int 특별소득공제_장기주택저당차입금이자상환액_2015년이후_30년이상고정OR비거치_국세청자료 = 0;
    public int 특별소득공제_장기주택저당차입금이자상환액_2015년이후_30년이상고정OR비거치_차감금액 = 0;
    public int 특별소득공제_장기주택저당차입금이자상환액_2015년이후_30년이상고정OR비거치_기타자료 = 0;

    public int 그밖의소득공제_개인연금저축_납입금액 = 0;
    public int 그밖의소득공제_개인연금저축_차감금액 = 0;

    public int 그밖의소득공제_소기업소상공인공제부금_국세청자료_납입금액 = 0;
    public int 그밖의소득공제_소기업소상공인공제부금_국세청자료_차감금액 = 0;
    public int 그밖의소득공제_소기업소상공인공제부금_기타자료_납입금액 = 0;
    public int 그밖의소득공제_소기업소상공인공제부금_기타자료_차감금액 = 0;

    public String 그밖의소득공제_주택마련저축_청약저축_가입일자 = "";
    public int 그밖의소득공제_주택마련저축_청약저축_납입금액 = 0;
    public int 그밖의소득공제_주택마련저축_청약저축_차감금액 = 0;
    public String 그밖의소득공제_주택마련저축_주택청약종합저축2014년이전_가입일자 = "";
    public int 그밖의소득공제_주택마련저축_주택청약종합저축2014년이전_납입금액 = 0;
    public int 그밖의소득공제_주택마련저축_주택청약종합저축2014년이전_차감금액 = 0;
    public String 그밖의소득공제_주택마련저축_주택청약종합저축2015년이후_가입일자 = "";
    public int 그밖의소득공제_주택마련저축_주택청약종합저축2015년이후_납입금액 = 0;
    public int 그밖의소득공제_주택마련저축_주택청약종합저축2015년이후_차감금액 = 0;
    public String 그밖의소득공제_주택마련저축_근로자주택마련저축_가입일자 = "";
    public int 그밖의소득공제_주택마련저축_근로자주택마련저축_납입금액 = 0;
    public int 그밖의소득공제_주택마련저축_근로자주택마련저축_차감금액 = 0;

    // 2018
    public int 그밖의소득공제_투자조합출자_YEAR_조합 = 0;
    public int 그밖의소득공제_투자조합출자_YEAR_벤처 = 0;
    // 2017
    public int 그밖의소득공제_투자조합출자_YEAR1_조합 = 0;
    public int 그밖의소득공제_투자조합출자_YEAR1_벤처 = 0;
    // 2016
    public int 그밖의소득공제_투자조합출자_YEAR2_조합 = 0;
    public int 그밖의소득공제_투자조합출자_YEAR2_벤처 = 0;

    public int 그밖의소득공제_신용카드_신용카드 = 0;
    public int 그밖의소득공제_신용카드_현금영수증 = 0;
    public int 그밖의소득공제_신용카드_직불카드 = 0;
    public int 그밖의소득공제_신용카드_전통시장 = 0;
    public int 그밖의소득공제_신용카드_대중교통 = 0;
    public int 그밖의소득공제_신용카드_도서공연 = 0;

    public int 그밖의소득공제_신용카드_신용카드_차감금액 = 0;
    public int 그밖의소득공제_신용카드_현금영수증_차감금액 = 0;
    public int 그밖의소득공제_신용카드_직불카드_차감금액 = 0;
    public int 그밖의소득공제_신용카드_전통시장_차감금액 = 0;
    public int 그밖의소득공제_신용카드_대중교통_차감금액 = 0;
    public int 그밖의소득공제_신용카드_도서공연_차감금액 = 0;

    public int 그밖의소득공제_우리사주조합_납입금액 = 0;
    public int 그밖의소득공제_우리사주조합_벤처_납입금액 = 0;
    public int 그밖의소득공제_고용유지중소기업_납입금액 = 0;
    public int 그밖의소득공제_장기잡합투자_납입금액 = 0;
    public int 그밖의소득공제_장기잡합투자_차감금액 = 0;

    // 소득공제를 위해 2013년 값 넣기
    public int 세액공제_특별세액공제_기부금_이월분_2013종교단체외지정기부금 = 0;
    public int 세액공제_특별세액공제_기부금_이월분_2013종교단체지정기부금 = 0;

    // 세액공제
    public int 세액공제_세액감면_소득세법 = 0;
    public int 세액공제_세액감면_외국인기술자 = 0;
    public int 세액공제_세액감면_중소기업100 = 0;
    public int 세액공제_세액감면_중소기업50 = 0;
    public int 세액공제_세액감면_중소기업70 = 0;
    public int 세액공제_세액감면_중소기업90 = 0;
    public int 세액공제_세액감면_조세조약 = 0;

    public int 세액공제_근로소득세액공제_자녀세액공제 = 0;
    public int 세액공제_근로소득세액공제_출산입양_첫째 = 0;
    public int 세액공제_근로소득세액공제_출산입양_둘째 = 0;
    public int 세액공제_근로소득세액공제_출산입양_셋째 = 0;

    public int 세액공제_연금계좌세액공제_과학기술인공제 = 0;
    public int 세액공제_연금계좌세액공제_퇴직연금공제 = 0;
    public int 세액공제_연금계좌세액공제_연금저축공제 = 0;

    public int 세액공제_특별세액공제_보험료_보장성보험료 = 0;
    public int 세액공제_특별세액공제_보험료_장애인전용보장성보험료 = 0;

    public int 세액공제_특별세액공제_의료비_본인장애인 = 0;
    public int 세액공제_특별세액공제_의료비_난임시술비 = 0;
    public int 세액공제_특별세액공제_의료비_일반 = 0;

    public int 세액공제_특별세액공제_교육비_본인 = 0;
    public int 세액공제_특별세액공제_교육비_장애인 = 0;
    public int[] 세액공제_특별세액공제_교육비_취학전 = {0};
    public int[] 세액공제_특별세액공제_교육비_초중고 = {0};
    public int[] 세액공제_특별세액공제_교육비_대학생 = {0};

    // 2018
    public int 세액공제_특별세액공제_기부금_YEAR_법정기부금 = 0;
    public int 세액공제_특별세액공제_기부금_YEAR_정치자금기부금 = 0;
    public int 세액공제_특별세액공제_기부금_YEAR_종교단체외지정기부금 = 0;
    public int 세액공제_특별세액공제_기부금_YEAR_종교단체지정기부금 = 0;
    public int 세액공제_특별세액공제_기부금_YEAR_우리사주조합기부금 = 0;
    public int 세액공제_특별세액공제_기부금_YEAR_기부장려금신청액 = 0;
    public int 세액공제_특별세액공제_기부금_YEAR_기타 = 0;

    // 2017
    public int 세액공제_특별세액공제_기부금_이월분_YEAR1_법정기부금 = 0;
    public int 세액공제_특별세액공제_기부금_이월분_YEAR1_종교단체외지정기부금 = 0;
    public int 세액공제_특별세액공제_기부금_이월분_YEAR1_종교단체지정기부금 = 0;
    // 2016
    public int 세액공제_특별세액공제_기부금_이월분_YEAR2_법정기부금 = 0;
    public int 세액공제_특별세액공제_기부금_이월분_YEAR2_종교단체외지정기부금 = 0;
    public int 세액공제_특별세액공제_기부금_이월분_YEAR2_종교단체지정기부금 = 0;
    // 2015
    public int 세액공제_특별세액공제_기부금_이월분_YEAR3_법정기부금 = 0;
    public int 세액공제_특별세액공제_기부금_이월분_YEAR3_종교단체외지정기부금 = 0;
    public int 세액공제_특별세액공제_기부금_이월분_YEAR3_종교단체지정기부금 = 0;
    // 2014
    public int 세액공제_특별세액공제_기부금_이월분_YEAR4_법정기부금 = 0;
    public int 세액공제_특별세액공제_기부금_이월분_YEAR4_종교단체외지정기부금 = 0;
    public int 세액공제_특별세액공제_기부금_이월분_YEAR4_종교단체지정기부금 = 0;
    // 2013
    public int 세액공제_특별세액공제_기부금_이월분_YEAR5_종교단체외지정기부금 = 0;
    public int 세액공제_특별세액공제_기부금_이월분_YEAR5_종교단체지정기부금 = 0;

    public int 세액공제_기타세액공제_납세조합공제 = 0;
    public int 세액공제_기타세액공제_주택차입금이자세액공제 = 0;
    public int 세액공제_기타세액공제_외국납부세액공제 = 0;
    public int 세액공제_기타세액공제_월세액공제_연간월세액 = 0;
    public int 세액공제_기타세액공제_월세액공제_공제대상금액 = 0;

    public int 기납부세액_소득세 = 0;
    public int 기납부세액_지방소득세 = 0;
    public int 기납부세액_농어촌특별세 = 0;
    public int 기납부세액_전근무지_소득세 = 0;
    public int 기납부세액_전근무지_지방소득세 = 0;
    public int 기납부세액_전근무지_농어촌특별세 = 0;
    public int 납부특례세액_소득세 = 0;
    public int 납부특례세액_지방소득세 = 0;
    public int 납부특례세액_농어촌특별세 = 0;
    
    public String 계약ID;
    public String 사용자ID;
}
